# Perf monitoring CLI tool for Apple Silicon
brew "asitop"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# General purpose syntax highlighter in pure Go
brew "chroma"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Library for USB device access
brew "libusb"
# USB programmer
brew "dfu-util"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# SDL2 compatibility layer that uses SDL3 behind the scenes
brew "sdl2-compat"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Generic library support script
brew "libtool"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Tool Command Language
brew "tcl-tk"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Library for communicating with USB and Bluetooth HID devices
brew "hidapi"
# Improved top (interactive process viewer)
brew "htop"
# Full featured terminal-based screen editor
brew "joe"
# Next-gen compiler infrastructure
brew "llvm"
# List USB devices, just like the Linux lsusb command
brew "lsusb"
# Keep your Mac's application settings in sync
brew "mackup"
# Menu-driven communications program
brew "minicom"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# General-purpose scripting language
brew "php@8.3", link: true
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Tool for managing OCI containers and pods
brew "podman"
# Python version management
brew "pyenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Cross-shell prompt for astronauts
brew "starship"
# Official documentation format of the GNU project
brew "texinfo"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# 3D parametric modeller
cask "freecad"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Electronics design automation suite
cask "kicad"
# Music app blocker utility
cask "music-decoy"
# Programmable solid 3D CAD modeller
cask "openscad"
vscode "chrmarti.regex"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "janisdd.vscode-edit-csv"
vscode "moshfeu.compare-folders"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "nicollasr.vscode-streamdeck"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
npm "@elgato/cli"
npm "@github/copilot"
npm "@mermaid-js/mermaid-cli"
npm "markdown-pdf"
npm "node-pandoc-filter"
npm "pandoc-filter"
